# pandas merge() function

In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                "Class":[9,10,11,12]})

In [3]:
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [4]:
df2=pd.DataFrame({'ID':[1,2,3,4],
                "Name":['mohak','nitish','ronik','hariom']})

In [5]:
df2

   ID    Name
0   1   mohak
1   2  nitish
2   3   ronik
3   4  hariom

In [6]:
# merging both dataframes together
# it must have a label is same in both the dataframe

In [7]:
pd.merge(df1,df2,on="ID") #df1 is left and df2 is right

   ID  Class    Name
0   1      9   mohak
1   2     10  nitish
2   3     11   ronik
3   4     12  hariom

In [8]:
pd.merge(df2,df1,on="ID")

   ID    Name  Class
0   1   mohak      9
1   2  nitish     10
2   3   ronik     11
3   4  hariom     12

In [9]:
df1=pd.DataFrame({'ID':[1,2,3,5],
                "Class":[9,10,11,12]})

In [10]:
# if ID will not same, means one then unmatched entry will not be merged

In [11]:
pd.merge(df2,df1,on="ID",how='inner') #innner means intersection

   ID    Name  Class
0   1   mohak      9
1   2  nitish     10
2   3   ronik     11

In [12]:
pd.merge(df2,df1,on="ID",how='left') #if common value not found the it will print nan

   ID    Name  Class
0   1   mohak    9.0
1   2  nitish   10.0
2   3   ronik   11.0
3   4  hariom    NaN

In [13]:
pd.merge(df2,df1,on="ID",how='right') #innner means intersection

   ID    Name  Class
0   1   mohak      9
1   2  nitish     10
2   3   ronik     11
3   5     NaN     12

In [14]:
pd.merge(df2,df1,on="ID",how='outer') #innner means intersection

   ID    Name  Class
0   1   mohak    9.0
1   2  nitish   10.0
2   3   ronik   11.0
3   4  hariom    NaN
4   5     NaN   12.0

In [15]:
pd.merge(df1,df2,on="ID",how='outer',indicator=True) #indicate is used to know about each row

   ID  Class    Name      _merge
0   1    9.0   mohak        both
1   2   10.0  nitish        both
2   3   11.0   ronik        both
3   5   12.0     NaN   left_only
4   4    NaN  hariom  right_only

In [16]:
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   5     12

In [17]:
df2=pd.DataFrame({'ID':[6,7,8,9],
                "Name":['mohak','nitish','ronik','hariom']})

In [18]:
df2

   ID    Name
0   6   mohak
1   7  nitish
2   8   ronik
3   9  hariom

In [19]:
# now both df have no common index|

In [20]:
pd.merge(df1,df2,left_index=True,right_index=True) #when we have multi index and different diffent value then we will use this method

   ID_x  Class  ID_y    Name
0     1      9     6   mohak
1     2     10     7  nitish
2     3     11     8   ronik
3     5     12     9  hariom

In [21]:
df1=pd.DataFrame({'ID':[1,2,3,5],
                "Class":[9,10,11,12]})

In [22]:
df2=pd.DataFrame({'ID':[1,2,3,5],
                "Class":[9,10,11,12]})

In [23]:
# now both df are same

In [26]:
pd.merge(df1,df2,on="ID") #class value will be show using parameter suffixes

   ID  Class_x  Class_y
0   1        9        9
1   2       10       10
2   3       11       11
3   5       12       12

In [27]:
pd.merge(df1,df2,on="ID",suffixes=('_Higher','Middle'))

   ID  Class_Higher  ClassMiddle
0   1             9            9
1   2            10           10
2   3            11           11
3   5            12           12